tutorials/lesCavitatingFoam/throttle3D/system/controlDict
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.4                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;

    root            "";
    case            "";
    instance        "";
    local           "";

    class           dictionary;
    object          controlDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

startFrom                  latestTime;

startTime                  0;

stopAt                     endTime;

endTime                    1e-4;

deltaT                     1e-8;

writeControl               adjustableRunTime;

writeInterval              5e-6;

purgeWrite                 0;

writeFormat                binary;

writePrecision             6;

writeCompression           compressed;

timeFormat                 general;

runTimeModifiable          yes;

adjustTimeStep             on;

maxCo                      0.5;

maxAcousticCo              50.0;

functions
(
/*
    fieldAverage1
    {
        // Type of functionObject
        type fieldAverage;

        // Where to load it from (if not already in solver)
        functionObjectLibs ("libfieldAverage.so");

        // Fields to be probed. runTime modifiable!
        fields
        (
            U
            {
                mean            on;
                prime2Mean      off;
                base            time;
            }
            p
            {
                mean            on;
                prime2Mean      off;
                base            time;
            }
            gamma
            {
                mean            on;
                prime2Mean      off;
                base            time;
            }
        );
    }
*/
);

// ************************************************************************* //
